[
    "Dejan\nNorth Macedonia\nDuplex Apartment\n4 nights · July 2024\nGroup\nReviewed: July 30, 2024\nPleasant\nScored 6.0\n6.0\nGood location, the beds were comfortable and the bathrooms were okay. Not that expencieve.\nWasn't that clean, some doors were damaged and coundn't close, there wasn't table on the terace. Photes were not exactly same as the the apartments.\n3 person found this review helpful.\nHelpful\nNot helpful",
    "Uliana\nCanada\nOne-Bedroom Apartment\n8 nights · June 2025\nFamily\nReviewed: June 27, 2025\nSpacious apartment in a perfect location with great views — but some outdated appliances could use a refresh.\nScored 7.0\n7.0\nThe location was perfect — very central, with easy access to shops, cafes, and public transport. The view from the window was beautiful, overlooking a peaceful courtyard with trees and flowers. The apartment itself was spacious, which was great for our family. It was also well-equipped for staying with kids, and the host was always responsive and available when needed.\nThe TV was quite basic and didn’t support Netflix or YouTube, only regular channels. Some of the appliances, like the washing machine and dishwasher, were old and didn’t always work properly. Also, there was a noticeable smell coming from the cupboards when opened. Bathroom amenities (soap, shampoo) were provided in thick gel dispensers, which felt a bit unpleasant.\nHelpful\nNot helpful",
    "H\nHugh\nIreland\nTwo-Bedroom Superior Apartment with Garden\n5 nights · November 2024\nFamily\nReviewed: November 25, 2024\nGood\nScored 7.0\n7.0\nCommfortable apartment\nCommunication to me with regard to location and entry was not clear. Tell host he/she meeds to replace covering on outside dining area.\nHelpful\nNot helpful",
    "Bayram\nTurkey\nTwo-Bedroom Apartment with Garden\n3 nights · October 2024\nGroup\nReviewed: October 25, 2024\nLike home\nScored 8.0\n8.0\nIt’s just like home. Really peaceful and spacious\nHelpful\nNot helpful",
    "A\nAnne\nGermany\nTwo-Bedroom Superior Apartment with Garden\n5 nights · October 2024\nCouple\nReviewed: October 19, 2024\nPleasant\nScored 6.0\n6.0\nsuper located. lovely neighbourhood!\ncleaning\nHelpful\nNot helpful",
    "C\nCleworth\nUnited Kingdom\nTwo-Bedroom Apartment with Garden\n3 nights · September 2024\nFamily\nReviewed: October 3, 2024\nVery Good\nScored 8.0\n8.0\nGreat location very close to a square with lots of places to eat. Get there early to get a table as the square gets busy.\nLock on the door to get in isn't that easy to operate via an app on the smart phone.\n2 person found this review helpful.\nHelpful\nNot helpful",
    "Laura\nIreland\nTwo-Bedroom Superior Apartment with Garden\n6 nights · September 2024\nCouple\nReviewed: September 28, 2024\nbeware\nScored 7.0\n7.0\nlocation was brilliant\nI didn't like the fact that I was asked for an additional 300 safety deposit and as I cleaned this place up after me the safety deposit was kept even after multiple attempts to contact the company\n9 person found this review helpful.\nHelpful\nNot helpful",
    "Burcu\nTurkey\nTwo-Bedroom Apartment with Garden\n4 nights · April 2024\nFamily\nReviewed: April 20, 2024\nFeelingLisbon\nScored 8.0\n8.0\nCheck-in was clear and easy, the house owners were helpfull and problem solvers. Fast feedbacks. Great hosting.\nUnfortunately we couldn't stay at the apartment that we booked because of some infiltration problem, that we were informed before check-in. Instead they arranged us another apartment, actually the whole building. The new place was 3 rooms 4 bathrooms and with a terrace. The new building was bigger and closer to the metro station. However it needed renovation for all the bathrooms and kitchen. Some housewares and curtains were missing. But totally we were happy, because the ladies were very helpful, incase we didn`t like the new house they were ready to change for some other houses.\nHelpful\nNot helpful",
    "Qurat\nPakistan\nTwo-Bedroom Apartment with Garden\n5 nights · April 2024\nFamily\nReviewed: April 24, 2024\nVery Good\nScored 8.0\n8.0\nIt was a good location. The flat had all the amenities\nThere was a certain smell in the apartment. The apartment was not cleaned properly\n2 person found this review helpful.\nHelpful\nNot helpful",
    "Simon\nUnited Kingdom\nDuplex Apartment\n6 nights · June 2025\nGroup\nReviewed: June 21, 2025\nGreat place for a stay in Lisbon\nScored 10\n10\nA very comfortable apartment with good-sized rooms.\nGood location with plenty of supermarkets within 5 minutes walk.\nMany restaurants nearby and 5 minutes walk to the Botanic Gardens\nOnly a 20 minute walk to the centre of Lisbon\nGood communications with the owner.\n4 minute walk to the metro station (and 40 minutes to the airport with 1 change) and local busses\nHelpful\nNot helpful",
    "B\nBurrows\nUnited Kingdom\nTwo-Bedroom Apartment with Balcony\n3 nights · June 2024\nGroup\nReviewed: June 27, 2024\nComfortable, with good location for young groups\nScored 10\n10\nWe liked the balcony, and the lounge area as a place to relax. Having a kitchen to cook was also very useful\nOn occasion the keycard on the phone would play up for a couple of minutes, but it always worked in the end\nHelpful\nNot helpful",
    "Caspian\nUnited Kingdom\nTwo-Bedroom Superior Apartment with Garden\n4 nights · June 2024\nCouple\nReviewed: June 9, 2024\nGreat location and very comfortable stay\nScored 9.0\n9.0\nGreat location, and the facilities were lovely and comfortable. Plus there staff where brilliant.\nNothing\nHelpful\nNot helpful",
    "Mher\nBelgium\nDuplex Apartment\n2 nights · September 2024\nSolo traveler\nReviewed: October 16, 2024\nI would not stay at this accommodation again and would not recommend it.\nScored 4.0\n4.0\nGood location in the city, close to cafes and not far from the train station.\nI had a lot of issues with communicating from the host from the beginning. It started with finding out the address of the apartment is different to what is stated on Booking.com. To enter the apartment (after 19:00) I had to download an app which I wasn't aware of during booking, and quite late. Had I not have enough battery, data to download the app or been a person not accustomed to tech use or had accessibility barriers using the app, I could not have entered the apartment, not to mention having to share personal data with an unknown app is not great in terms of privacy. There were cockroaches in the apartment, including a huge one climbing onto the bedroom wall at night. My request to change the apartment was rejected. Instead the host suggested to spray poison in the apartment. That evening I saw another cockroach strolling around the kitchen, on cutlery and inside the toaster. I had to send a copy of my ID and deposit transfer confirmations via WhatsApp and email to the host, even though they noted that it's possible to do this via Booking.com (which I would prefer due to security reasons but which was not possible). Finally, I had to chase them to get the 300EUR deposit back after the 7 day limit within which they would have to return it even though I had contacted them a few days in advance to check if I can expect it on time and the host told me \"of course.\" I would say all the issues came down to lack of care and communication by the host, which is a real pity because the apartment itself was quite nice and in a very good location in the city. If the host starts approaching it as a place where guests feel welcome and comfortable rather than a money-milking machine, things could considerably improve.\n1 person found this review helpful.\nHelpful\nNot helpful",
    "Ngai\nUnited Kingdom\nTwo-Bedroom Superior Apartment with Garden\n4 nights · July 2024\nFamily\nReviewed: July 31, 2024\nFair\nScored 5.0\n5.0\nThe interior design is great. All home appliances are in the apartment except washing machine.\nThe door of the bathroom can not close properly. The upper floor was very nosy every midnight when we stayed. \nWe found 2 dead cockroaches in the living room when we arrived.\nHelpful\nNot helpful",
    "S\nStine\nDenmark\nTwo-Bedroom Superior Apartment with Garden\n5 nights · July 2024\nGroup\nReviewed: July 27, 2024\nEverything was fine. Nice area, we could walk to everything\nScored 10\n10\nBeliggenheden var perfekt. Man kunne gå til bymidten. Meget fint kvarter\nAlt var fint\nHelpful\nNot helpful",
    "A\nAmanda\nUnited States\nTwo-Bedroom Apartment with Garden\n3 nights · January 2024\nGroup\nReviewed: January 16, 2024\nNice place; terribly rude host which\nScored 4.0\n4.0\nLocation and comfortable beds.\nThe lady who worked in the office was nice in person. I’m not sure who works their messaging account, but I highly do not recommend communicating with them on WhatsApp. They were extremely rude on WhatsApp. They accused us of having 3 additional guest while there. When in fact, I had contacted Booking customer service to inform them prior to checking in, that we would have 3 guest instead of 2. At the same time, I told them I do not have an IBAN account to give them the 300€ deposit; they said it’d be fine to go without. Then while boarding my plane, I was told I needed to give a 300€ cash deposit at the office prior to checking in and then pick up the deposit at check out (even though I was checking out prior to the office opening). The host was demanding via WhatsApp and rude. Was not helpful in regards to where to park, until I persistently asked several times.\n\nI am Genius level 3 and use Booking almost monthly for stays, and this place was by far the rudest host. Would not recommend (and this is the first place I’ve ever not recommended)\n\nOther things to note: no hand soap in the bathroom.\n2 person found this review helpful.\nHelpful\nNot helpful",
    "Marco\nSwitzerland\nStudio with Terrace\n5 nights · October 2024\nSolo traveler\nReviewed: November 3, 2024\nOverpriced dirtthyappartment\nScored 1.0\n1.0\nVery dirty, not even soap was there\nHelpful\nNot helpful",
    "F\nFrancesco\nItaly\nTwo-Bedroom Superior Apartment with Garden\n5 nights · July 2024\nGroup\nReviewed: July 25, 2024\nAlmost a scamming\nScored 1.0\n1.0\nThe position of the Apartment is very nice, close to the hystorical centre of Lisbon, although the Apartment we got was not in Rua Manuel Bernardes 3, as in the Booking confirmation, but in Rua da Quintinha 16. This is not far from the Booking location, but is completely different from the pictures you can see in the Booking.com site, and there only 1 Bathroom instead of 2 Bathrooms.\nThere are too many negatives, both from the apartment and from the host:\n1. The apartment was different and worse than the one we booked: older, dirtier. \n Only one bathroom instead of two bathrooms. \n The second Bedroom with 2 small beds instead of a double bad.\n2. Terrible cleaning, the apartment is infested with cockroaches, we find them dead and almost alive under the sofa, \n other the furniture and near the large window. They were aware because there were traps everywhere (see photo)\n Outside the small garden had not been cleaned for a long time and was full of dead cockroaches.\n They came to clean when we complained.\n3. I couldn't use the dishwasher because it was clogged with stagnant and smelly water inside.\n They came to fix it, just starting the machine.\n4. the TV decoder didn't work. Never fixed.\n5. last but not least, once I left the apartment, I asked to receive back the €300 deposit, which I paid via bank transfer. \n For almost a week they used a different excuse every day not to return the money. They are using customers as a \n bank to make money from your money in their bank account for an excessive week.\n1 person found this review helpful.\nHelpful\nNot helpful",
    "Marc\nUnited States\nLoft with Terrace\n4 nights · April 2024\nCouple\nReviewed: April 28, 2024\nWould not stay here or recommend this property.\nScored 1.0\n1.0\nLocation was perfect. Walkable to all the cool places. Rooftop terrace!\nOriginal location canceled due to infestation. Company put us at this location 5 mins away. Only had hot water twice in 4 days. 2nd floor bathroom shower was clogged. 3 sets of unlabeled keys, had to guess which ones for each floor. Not able to close apartment front door. No soap in any of the bathrooms. Musty master bedroom.\nHelpful\nNot helpful",
    "M\nMarco\nItaly\nTwo-Bedroom Apartment with Garden\n4 nights · August 2023\nGroup\nReviewed: September 11, 2023\nworst booking experience of a lifetime\nScored 1.0\n1.0\nnothing\neverything\nProperty response:\nMarco and his group of young friends behaved very badly,...\nContinue reading\n1 person found this review helpful.\nHelpful\nNot helpful",
    "C\nCarlos\nSpain\nStandard Apartment\n7 nights · October 2024\nFamily\nReviewed: October 21, 2024\nGood\nScored 7.0\n7.0\nApartamento con mucha luz, bien situado del centro, bien distribuido las habitaciones y la cama muy cómoda.\nLo digo como recomendación.\nLa diferencia entre normal y excelente en muchas ocasiones son los detalles. \nEste apartamento podría ser un excelente solo repasando algunos detalles, por la ubicación, la luz, la distribución etc etc pero está faltado de ir repasando los detalles.\nSobretodo cosas rotas y limpieza en algunas lámparas.\nEn general le pongo un 7'5 de puntuación.\nShow translation\nHelpful\nNot helpful",
    "Fabienne\nFrance\nTwo-Bedroom Apartment with Garden\n7 nights · July 2024\nGroup\nReviewed: August 7, 2024\ntres reactif et flexible\nScored 8.0\n8.0\nrapidité de reaction pour rendre le logement disponible en 4 suite à un pb booking.com, merci bcq\nShow translation\n1 person found this review helpful.\nHelpful\nNot helpful",
    "P\nPatrice\nFrance\nTwo-Bedroom Superior Apartment with Garden\n7 nights · April 2024\nFamily\nReviewed: April 29, 2024\nVery Good\nScored 8.0\n8.0\nL' emplacement proche square, ainsi qu' épiceries et restaurants , petite rue dans quartier typique de lisbonne, appartement propre, confortable, bien équipé (lave linge, lave vaisselle) petit patio, bien desservi par les transports en commun dont la ligne de tramway 28 (10 à 15 minutes à pied). L'hôte est très réactif et de bons conseils\nShow translation\nHelpful\nNot helpful",
    "B\nBente\nNetherlands\nTwo-Bedroom Apartment with Garden\n5 nights · May 2025\nCouple\nReviewed: June 3, 2025\nPleasant\nScored 6.0\n6.0\nRuim appartement, grote kamers. Toegang met een code, werkte goed. Appartement ligt op een leuke locatie, lopend is veel en makkelijk bereikbaar.\nEen appartement geboekt met een tuin en een apart toilet, echter en ander appartement gekregen zonder tuin of balkon. Dit was niet te bespreken met de verhuurder, ondanks bewijs van de boeking. Appartement was verder prima en ruim. Helaas was de badkamer verouderd en was er geen apart toilet\nShow translation\nHelpful\nNot helpful",
    "Daniel\nFrance\nLoft with Terrace\n6 nights · May 2025\nCouple\nReviewed: May 6, 2025\nSéjour de charme mais un peu malcommode à l’usage\nScored 7.0\n7.0\nLe quartier et le charme de l’appartement bien décoré. Salle de bains pratique. Excellent couchage.\nLa table et les tabourets hauts (trop hauts pour la table), l’ensemble inadapté à la hauteur du plafond . Mieux vaudrait une table et des chaises normales. Une rampe pour la dernière volée d’escalier serait nécessaire.\nShow translation\nHelpful\nNot helpful",
    "Anne\nFrance\nTwo-Bedroom Apartment with Garden\n14 nights · September 2024\nGroup\nReviewed: October 8, 2024\nJe n'ai pas récupérer ma caution, sans raison. J'attends et vous remercie d'avance\nScored 8.0\n8.0\nNous avons fait revenir le service de nettoyage. ça s'est bien passé.\nShow translation\n3 person found this review helpful.\nHelpful\nNot helpful",
    "Anthony\nFrance\nDuplex Apartment\n4 nights · August 2024\nFamily\nReviewed: September 22, 2024\nGood\nScored 7.0\n7.0\nla situation géographique du logement\nlocation proche de tout \nune salle de bain et des toilettes pour chaque chambre et chaque étage\nun petit peu plus d'équipements de cuisine pourrait être appréciable\nShow translation\n1 person found this review helpful.\nHelpful\nNot helpful",
    "Florurbani\nSpain\nDuplex Apartment\n5 nights · June 2024\nGroup\nReviewed: August 28, 2024\nBuena ubicación y muy espacioso, con varios baños\nScored 7.0\n7.0\nEs un departamento amplio y espacioso con tres pisos y al menos un baño por piso. Aunque la decoración es un poco antigua estaba muy limpio. Ubicado relativamente cerca del centro, a unos 20 minutos caminando, se encuentra en una zona tranquila.\nLa decoración del lugar es un poco antigua y sombría, pero estaba en impecable condiciones\nShow translation\n1 person found this review helpful.\nHelpful\nNot helpful",
    "Javier\nSpain\nTwo-Bedroom Superior Apartment with Garden\n5 nights · August 2024\nGroup\nReviewed: August 16, 2024\nGood\nScored 7.0\n7.0\nPAra la apertura de puertas se usa una aplicación móvil, lo que es cómodo.\nEl apartamento que nos dieron no era el de las fotografías, a pesar de no estar mal, la limpieza era mejorable. El segundo dormitorio de matrimonio no era cómodo\nShow translation\nHelpful\nNot helpful",
    "L\nLou\nFrance\nDuplex Apartment\n4 nights · July 2024\nGroup\nReviewed: July 22, 2024\nJe recommande\nScored 7.0\n7.0\nEmplacement / rapport qualité-prix/ terrasse\nLa communication pour le Check-in\nShow translation\nHelpful\nNot helpful",
    "B\nNetherlands\nTwo-Bedroom Superior Apartment with Balcony\n4 nights · March 2024\nCouple\nReviewed: March 15, 2024\nPrima accomodatie, wel wat details die beter kunnen.\nScored 8.0\n8.0\nFijne lokatie, stille straat, het plein om de hoek heeft leuke cafés. Goede uitrusting van de keuken, wasmachine, vaatwasser. Schoon beddengoed. Attente verhuurder.\nHelaas is de douche primitief, slecht geventileerd en er is schimmelvorming. Het zou fijn zijn dat er enkele vaatwasblokjes aanwezig zouden zijn en betere schoonmaakmiddelen.\nShow translation\nHelpful\nNot helpful",
    "1\n1968\nNetherlands\nTwo-Bedroom Superior Apartment with Balcony\n4 nights · January 2024\nFamily\nReviewed: January 6, 2024\nVery Good\nScored 8.0\n8.0\nFijne locatie in Lissabon, park, terrasjes en supermarkt in de buurt.\nShow translation\nHelpful\nNot helpful",
    "Sebastián\nSpain\nStandard Apartment\n3 nights · April 2025\nFamily\nReviewed: April 26, 2025\nPleasant\nScored 6.0\n6.0\nLa ubicación.\nQue reservamos dos apartados y en la reserva no decía que eran en diferentes direcciones.\nShow translation\nHelpful\nNot helpful",
    "A\nAdiba\nFrance\nLoft with Terrace\n3 nights · November 2024\nCouple\nReviewed: November 18, 2024\nAgréable\nScored 6.0\n6.0\nLa maison avec terrasse, pas de bruit\nLes escaliers ,3 etages sans ascenseur ,c dur pour les bagages\nShow translation\nProperty response:\nThank you for your comment. We would like to clarify that...\nContinue reading\nHelpful\nNot helpful",
    "Mario\nSpain\nDuplex Apartment\n5 nights · October 2024\nGroup\nReviewed: October 30, 2024\nPleasant\nScored 6.0\n6.0\nUbicación y disponibilidad del anfitrión a resolver problemas. Nos consiguió una apartamento adicional por no poder utilizar uno de los dormitorios en nuestra estancia. Éramos 3 parejas.\nLa propiedad es una casa vieja cerca del jardín botánico de Lisboa. Tiene tres plantas con un dormitorio y un baño por planta. Las instalaciones e general son muy viejas y de uso limitado. Nosotros no pudimos usar el dormitorio de la planta baja por humedades y algo de moho. Los baños necesitan reforma urgente.\nShow translation\nHelpful\nNot helpful",
    "Alexandra\nColombia\nDuplex Apartment\n3 nights · August 2024\nGroup\nReviewed: August 6, 2024\nMuy costoso para lo que es\nScored 7.0\n7.0\nEra grande y la ubicación\nMuy deteriorado\nLas fotos no corresponden a la realidad\nParecía un cuarto de san alejo\nSin implementos de cocina - cubiertos \nSin aire acondicionado \nEl depósito de 300 euros no tiene justificación y no me lo han devuelto y ya van ocho días\nShow translation\nHelpful\nNot helpful",
    "M\nMelanie\nArgentina\nLoft with Terrace\n4 nights · June 2025\nSolo traveler\nReviewed: June 26, 2025\nMuy bonito departamento, buena ubicación y bien equipado.\nScored 9.0\n9.0\nEl departamento es precioso, está bien ubicado, tiene de todo cerca.\nTardaron en confirmarme que podía ingresar en la noche, lo cual podían hacer sin problema porque el ingreso es por código.\nShow translation\nHelpful\nNot helpful",
    "Vinicius\nBrazil\nTwo-Bedroom Apartment with Garden\n3 nights · May 2025\nFamily\nReviewed: June 6, 2025\nWonderful\nScored 9.0\n9.0\nLocalização excelente, casa com ótima infraestrutura\nO valor é elevado\nShow translation\nHelpful\nNot helpful",
    "C\nCecilia\nSpain\nTwo-Bedroom Apartment with Garden\n5 nights · April 2025\nCouple\nReviewed: May 7, 2025\nMaravilloso\nScored 10\n10\nEl apartamento es fantástico pero su magia y su anfitrión lo hacen perfecto :)\nNada, todo perfecto. Únicamente como curiosidad para el futuro, nos cogió el apagón de la luz y al tener la entrada con el móvil no pudimos entrar. Pero tampoco habrá apagones de luz todos los días :)\nShow translation\nHelpful\nNot helpful",
    "S\nSergio\nGermany\nTwo-Bedroom Apartment with Garden\n5 nights · August 2024\nFamily\nReviewed: October 8, 2024\nSuper toll, wir kommen wieder zurück.\nScored 10\n10\nSehr gemütlich.\nLeider sehr wenig Parkplätze für Touristen in der Gegend.\nShow translation\nHelpful\nNot helpful",
    "Nietotattoo\nSpain\nDuplex Apartment\n5 nights · July 2024\nFamily\nReviewed: July 22, 2024\nExceptional\nScored 10\n10\nTrato excelente! Bien ubicado! Y la anfitriona super resolutiva ante cualquier imprevisto\nShow translation\nHelpful\nNot helpful",
    "M\nMariachiara\nItaly\nTwo-Bedroom Apartment with Garden\n3 nights · July 2024\nFamily\nReviewed: July 2, 2024\nTutto benissimo. Facile e chiaro da raggiungere. Ottime indicazioni. Casa spaziosa comoda, ottima posizione. perfetta pe\nScored 10\n10\nBella posizione vicino carinissima praca das flores. Comoda. Confortevole. \nTutto il necessario.\nShow translation\nHelpful\nNot helpful",
    "M\nMabel\nArgentina\nTwo-Bedroom Apartment with Garden\n3 nights · April 2024\nGroup\nReviewed: April 21, 2024\nWonderful\nScored 9.0\n9.0\nLoa ambientes amplios, cómodos, iluminados y bien decorados\nLa atención de Hilda, excepcional \nEl patio\nIngreso por escaleras porque en el grupo hay una persona con reducida movilidad\nPoca iluminación en el baño principal. Solo detalles\nShow translation\n3 person found this review helpful.\nHelpful\nNot helpful",
    "J\nJavier\nArgentina\nTwo-Bedroom Apartment with Garden\n7 nights · January 2024\nFamily\nReviewed: January 8, 2024\nPase fin de año, con mi hija, fue un sueño, ese departamento y Lisboa\nScored 10\n10\nMe gustó todo, excelente! La decoración, lo amplio, muy cómodo!\nLas vistas! Volveré!\nShow translation\nHelpful\nNot helpful",
    "M\nMaximiliano\nArgentina\nTwo-Bedroom Superior Apartment with Balcony\n3 nights · December 2023\nCouple\nReviewed: December 2, 2023\nExceptional\nScored 10\n10\nLa cocina y las instalaciones muy bueno...\nMuy limpio y tranquilo.\nShow translation\n1 person found this review helpful.\nHelpful\nNot helpful",
    "A\nAntonella\nChile\nTwo-Bedroom Superior Apartment with Balcony\n4 nights · November 2023\nFamily\nReviewed: November 15, 2023\nExceptional\nScored 10\n10\nPor problemas técnicos no pudimos utilizar el alojamiento elegido, sin embargo el trato y comunicación con los encargados fue excepcional. Nos reubicaron tan pronto fue el problema y muy dirigente y resolutiva. Nos encantó que estuvieran siempre atenta y disponible para ayudarnos!\nNada!\nTodo fue mejor de lo esperado.\nShow translation\nHelpful\nNot helpful",
    "Albenice\nUnited Kingdom\nTwo-Bedroom Apartment with Garden\n6 nights · September 2024\nFamily\nReviewed: September 29, 2024\nFoi muito bom a estadia e o local e próximo de tudo\nScored 10\n10\nA casa é bem aconchegante\nA cama do primeiro quarto\nShow translation\nHelpful\nNot helpful",
    "T\nTito\nSpain\nTwo-Bedroom Superior Apartment with Garden\n2 nights · August 2024\nFamily\nReviewed: September 3, 2024\n3 días geniales.\nScored 10\n10\nLa terraza al aire libre.\nTardaron demasiado en devolver la fianza.\nShow translation\nHelpful\nNot helpful",
    "Fernando\nChile\nTwo-Bedroom Apartment with Garden\n2 nights · August 2024\nGroup\nReviewed: August 25, 2024\nUn lugar tranquilo para descansar y muy bien ubicado\nScored 10\n10\nLa ubicación y los espacios\nTodo bien\nShow translation\nHelpful\nNot helpful",
    "Z\nZerguine\nFrance\nStandard Apartment\n8 nights · July 2024\nGroup\nReviewed: July 29, 2024\nPoor\nScored 3.0\n3.0\nL'appartement était bien, quelque petits truc cassé mais rien de grave. L'appartement était bien situé.\nLES HOTES MON DIEU, on a eu beaucoup de mal à se comprendre et au lieu de comprendre cela et de voir qu'il y avait des malentendus, se sont permis de parler très mal, enorme manque de professionnalisme. Ne répondaient plus au moment de rendre la caution . Ne donnent aucune info, on est censé tout comprendre nous même et bien sur eux s'énervent lorsque nous comprenons rien. CAFARD DANS LA SALLE DE BAIN ET DANS LE HALL D'ENTREE (photo à l'appuie) . Se permettent des choses que nous ne leurs avons pas demandé ! Wifi ne fonctionne pas non plus. L'appartement était pour 4 et nous avons réservé pour 4 sur booking, devinez quoi lorsque nous leurs avons dit que nous étions 4, ils nous ont demandé de rajouter environ 300 euros pour les 2 autres personnes en plus alors que l'appartement était fait pour 4. Franchement à fuir.\nShow translation\n1 person found this review helpful.\nHelpful\nNot helpful",
    "Rayane\nItaly\nDuplex Apartment\n6 nights · December 2024\nGroup\nReviewed: January 3, 2025\nPoor\nScored 3.0\n3.0\nTerrible apartment, everything starts with the address, which is not the one on Booking.com, then the TV doesn't work. The apartment is for two people because the hot water runs out in the second shower. The table that opened up to make it bigger was full of bugs. Half of my guests started sending me messages asking what time I should check out. On my penultimate day, I replied and said 11:00, but on the day of checkout at 9:00, the cleaning lady woke me up to start cleaning. I don't recommend this apartment to anyone....\n\nPessimo apartamento tudo começa pelo endereço que não é esse que tem no Booking depois a tv não funciona, o apartamento é para duas pessoas porque a água quente acaba no segundo banho, a mesa que se abriva para ficar maior era cheio de insetos. a metade da minha hospedagem me começa a mandar mensagem perguntando, a que hora faço o checkout no meu penultimo dia respondo e dico as 11:00, porém no dia do checkout as 9:00 tinha a moça da limpeza que me acorda, para começar a limpar não recomendo a ninguém esse apartamento….\nShow translation\nProperty response:\nThank you for your feedback, although we were quite...\nContinue reading\nHelpful\nNot helpful",
    "Pascale\nFrance\nTwo-Bedroom Superior Apartment with Garden\n10 nights · October 2024\nGroup\nReviewed: October 18, 2024\nA ne pas recommencer au même endroit\nScored 1.0\n1.0\nen plein quartier touristique, génial\nWifi, appartement sale , manque de lumière , manque d’aération , 1 des deux chambres sans fenêtre,manque d’auvent pour la pluie afin de ne pas avoir une inondation durant la nuit, vol d’une valise entière + les articles neufs achetés à l’aéroport ainsi que l’écran de télévision qui lui appartenait à l’appartement, la mise en scene du vol en ouvrant en grand de la seule fenêtre donnant sur la rue, la perte de temps avec la POLICE portugaise ( qui est très gentille) 2 jours de suite pour le constat du vol…. ( helas d’après la police, les \"scams\" de ce genre sont de plus en plus fréquents a Lisbonne\nShow translation\nProperty response:\nNous avons bien pris connaissance de votre commentaire et...\nContinue reading\nHelpful\nNot helpful",
    "Sabine\nGermany\nDuplex Apartment\n3 nights · June 2024\nGroup\nReviewed: June 23, 2024\nFair\nScored 5.0\n5.0\nDie Größe und die Lage. Die Aufteilung von dem Haus.\nLeider war es nicht so sauber. Schimmel an verschiedenen Stellen. Schimmeliger Vorhang im oberen Bad. Duschkabine in der 2. Etage. nicht richtig funktionsfähig.\nShow translation\nHelpful\nNot helpful",
    "Mihail\nRussia\nDuplex Apartment\n11 nights · May 2024\nFamily\nReviewed: May 20, 2024\nСамое худшее жильё в моей жизни\nScored 1.0\n1.0\nХорошая локация \nВ доме есть необходимые вещи и чистые полотенца\nЭто аварийное жильё. Фото не соответствуют. Мы получили другую квартиру, не ту что на фото. Мы семья с детьми и нам дали дом на 4 этажа, в котором одна комната - один этаж. Нет гостиной. Мы никогда не бронируем даже двухуровневые апартаменты. Сантехника протекала. Плесень. Нижний этаж не пригоден для пребывания, там затхлых запах и плесень. Кровать на третьем этаже сломана и матрас прогибался. Не понимаю почему это стоило 1450€ за 10 дней. На террасе сухие цветы и сломанная мебель\nShow translation\n3 person found this review helpful.\nHelpful\nNot helpful",
    "R\nRosi\nBrazil\nTwo-Bedroom Superior Apartment with Garden\n6 nights · April 2025\nFamily\nReviewed: May 6, 2025\nNão existe acessibilidade e isso é grave\nScored 1.0\n1.0\nA região é interessante e arejada.\nQuando selecionamos o alojamento nos foi informado que tinha acessibilidade e estávamos com uma senhora de 89 anos, após a reserva, aquela que não devolve o investimento... vimos a informação de um lance de escadas...um lance? Uma escada de madeira com quase 20 degraus...além de um banheiro com banheira que ela não conseguia subir, para completar fomos num final de semana com feriado...vimos várias baratas andando transitando pela casa. As acomodações definitivamente precisam ser melhoradas, não tem acessibilidade, e não tem limpeza. A cláusula de não devolução é um absurdo, é coersivo num lugar que parece que tem certeza que terá desistência. Poças de água, já na cor esverdeada..sugiro que retirem a palavra acessibilidade do sua descrição e a não devolução de taxa de reserva é uma covardia pois te obriga a ficar em um lugar que não é como foi descrito., para pessoas de um outro país...foi o alojamento mais caro que pagamos na nossa viagem e o que mais trouxe frustrações. Dona Dina é o nome da senhora que fazia parte do grupo, levava um tempo tão grande para sair das acomodações que fazia isso apenas uma vez ao dia e algumas vezes desistiu de sair, assim como por pouco não sofreu uma queda, pois o corrimão não vai até o final dos degraus. E termino lembrando novamente...a escolha desse alojamento foi devido a acessibilidade informada, então, além de frustradas, nos sentimos enganadas. Solicito ao booking que reavalie esta acomodação, retirando a oferta de acessibilidade.\nShow translation\nProperty response:\nNormalmente não respondemos a comentários, porque já...\nContinue reading\nHelpful\nNot helpful",
    "K\nKrzysztof\nPoland\nTwo-Bedroom Apartment with Garden\n4 nights · July 2024\nFamily\nReviewed: July 30, 2024\nZło konieczne\nScored 4.0\n4.0\n- blisko centrum i zabytkowych dzielnic Lizbony, wszystko w zasięgu pieszej wycieczki.\n- ciśnienie wody\n- generalnie wszystko: ciemne mieszkanie, przytłaczające, brak klimatyzacji\n- ciężko wywietrzyć z uwagi na to, że mieszkanie jest na parterze na równo z chodnikiem. Otwarcie drzwi czy okna - ryzyko że ktoś wejdzie lub zaglądnie do mieszkania\n- stare, rozpadające się meble\n- dodatkowe WC bardzo ciasne i głośny wentylator\n- zabity karaluch w łazience \n- dzielnica brudna\n- brak miejsc parkingowych w pobliżu\nShow translation\nHelpful\nNot helpful",
    "J\nJozef\nGermany\nTwo-Bedroom Apartment with Balcony\n4 nights · July 2024\nFamily\nReviewed: July 19, 2024\nWir waren als Familie mit kleinen Kindern sehr enttäuscht und wurden die Wohnung nicht empfehlen.\nScored 1.0\n1.0\nDie Wohnung ist sehr zentral gelegen, an der Ecke ist ein nettes Café, auch Lebensmittelläden oder Restaurants sind schnell erreichbar. Man hat aus dem Zimmer einen schönen Blick auf das Parlamentsgebäude.\nDie Wohnung mussten wir noch mal fegen, die Wasch- und Spülmaschinen waren komplett schimmelig und rochen stark, sowie zum Teil auch das Badezimmer. Die Wohnung ist überhaupt nicht für Familien mit kleinen Kindern geeignet, so wie es unser Fall war.\nShow translation\n1 person found this review helpful.\nHelpful\nNot helpful",
    "G\nGraziano\nItaly\nTwo-Bedroom Superior Apartment with Garden\n2 nights · July 2024\nFamily\nReviewed: July 10, 2024\nPESSIMO appartamento sporco forte odore di fogna e presenza di biancheria intima di altre persone\nScored 1.0\n1.0\nposizione centrale\nforte odore di fogna, la finestra del bagno è all'interno del soggiorno e della cucina, all'interno dell'appartamento ci sono diversi gradini, moltissimi mobili non necessari che impediscono il passaggio, posto al 2 piano con gradini molto stretti\nShow translation\n+4\nHelpful\nNot helpful",
    "Marija\nNorth Macedonia\nStandard Apartment\n6 nights · June 2025\nSolo traveler\nReviewed: June 15, 2025\nVery Good\nScored 8.0\n8.0\nThere are no comments available for this review",
    "Ashok\nIndia\nDuplex Apartment\n14 nights · July 2024\nGroup\nReviewed: July 16, 2024\nGood\nScored 7.0\n7.0\nThere are no comments available for this review",
    "Marcin\nPoland\nDuplex Apartment\n3 nights · August 2022\nSolo traveler\nReviewed: September 1, 2022\nVery Good\nScored 8.0\n8.0\nThere are no comments available for this review",
    "L\nLoubna\nMorocco\nTwo-Bedroom Apartment with Garden\n3 nights · June 2025\nGroup\nReviewed: June 11, 2025\nWonderful\nScored 9.0\n9.0\nThere are no comments available for this review",
    "J\nJasmin\nCanada\nTwo-Bedroom Apartment with Garden\n3 nights · November 2024\nFamily\nReviewed: November 13, 2024\nExceptional\nScored 10\n10\nThere are no comments available for this review",
    "M\nMudit\nUnited Kingdom\nTwo-Bedroom Apartment with Garden\n3 nights · January 2024\nGroup\nReviewed: April 3, 2024\nHost was friendly and flexible with stay timing as our flight was quiet early.\nScored 9.0\n9.0\nThere are no comments available for this review",
    "A\nAudrey\nFrance\nDuplex Apartment\n4 nights · October 2024\nFamily\nReviewed: October 26, 2024\nVery Good\nScored 8.0\n8.0\nThere are no comments available for this review",
    "D\nDimajunglist\nNetherlands\nDuplex Apartment\n7 nights · May 2025\nGroup\nReviewed: May 24, 2025\nGood\nScored 7.0\n7.0\nThere are no comments available for this review",
    "I\nIryna\nUkraine\nTwo-Bedroom Apartment with Garden\n5 nights · November 2024\nFamily\nReviewed: November 8, 2024\nVery Good\nScored 8.0\n8.0\nThere are no comments available for this review",
    "Luzie\nGermany\nTwo-Bedroom Apartment with Garden\n4 nights · April 2024\nGroup\nReviewed: May 29, 2024\nVery Good\nScored 8.0\n8.0\nThere are no comments available for this review",
    "Irina\nGermany\nTwo-Bedroom Apartment with Garden\n4 nights · August 2023\nFamily\nReviewed: September 26, 2023\nVery Good\nScored 8.0\n8.0\nThere are no comments available for this review",
    "A\nAleksandra\nUkraine\nDuplex Apartment\n10 nights · September 2024\nGroup\nReviewed: September 20, 2024\nVery Good\nScored 8.0\n8.0\nThere are no comments available for this review",
    "B\nBel\nSpain\nTwo-Bedroom Superior Apartment with Garden\n4 nights · May 2025\nFamily\nReviewed: May 28, 2025\nWonderful\nScored 9.0\n9.0\nThere are no comments available for this review",
    "Alexandru\nSpain\nTwo-Bedroom Apartment with Garden\n4 nights · November 2024\nFamily\nReviewed: November 5, 2024\nExceptional\nScored 10\n10\nThere are no comments available for this review",
    "B\nBobbie\nNetherlands\nLoft with Terrace\n3 nights · October 2024\nGroup\nReviewed: November 4, 2024\nExceptional\nScored 10\n10\nThere are no comments available for this review",
    "Andrii\nUkraine\nDuplex Apartment\n4 nights · April 2024\nCouple\nReviewed: May 20, 2024\nExceptional\nScored 10\n10\nThere are no comments available for this review",
    "Hélio\nLuxembourg\nLoft with Terrace\n4 nights · February 2024\nCouple\nReviewed: April 7, 2024\nExceptional\nScored 10\n10\nThere are no comments available for this review",
    "C\nClaudio\nBrazil\nTwo-Bedroom Superior Apartment with Garden\n4 nights · October 2024\nFamily\nReviewed: November 28, 2024\nExceptional\nScored 10\n10\nThere are no comments available for this review",
    "A\nAnonymous\nSpain\nTwo-Bedroom Apartment with Garden\n5 nights · September 2024\nCouple\nReviewed: September 22, 2024\nExceptional\nScored 10\n10\nThere are no comments available for this review"
]